Repository: pepr/progit2-cs
Catalog: omegat/tm/auto/progit-omegat-asciidoc.tmx
Source language: en
Languages: cs

source: The `dcommit` command that you run erases any information that says what branch was merged in, so subsequent merge-base calculations will be wrong — the dcommit makes your `git merge` result look like you ran `git merge --squash`.
cs: Spustíte-li příkaz `dcommit`, smažete všechny informace, které sdělují, jaká větev byla začleněna, a všechny následné výpočty základny pro sloučení tak budou nesprávné. Příkaz dcommit způsobí, že bude výsledek příkazu `git merge` vypadat, jako byste spustili příkaz `git merge --squash`.

source: The `fetch-pack` process sends data that looks like this to the daemon after connecting:
cs: Proces `fetch-pack` pošle démonovi po připojení data, která mají následující podobu:

source: The `format-patch` command prints out the names of the patch files it creates.
cs: Příkaz `format-patch` vypíše názvy souborů záplaty, kterou vytváří.

source: The `gc` stands for garbage collect, and the command does a number of things: it gathers up all the loose objects and places them in packfiles, it consolidates packfiles into one big packfile, and it removes objects that aren’t reachable from any commit and are a few months old.
cs: Písmena `gc` jsou zkratkou anglického výrazu „garbage collect“ (sběr odpadků). Příkaz provádí hned několik věcí: sbírá všechny volné objekty a umisťuje je do balíčkových souborů, spojuje balíčkové soubory do jednoho velkého a odstraňuje objekty, jež nejsou dostupné z žádné revize a jsou starší několika měsíců.

source: The `git add` command takes a path name for either a file or a directory; if it’s a directory, the command adds all the files in that directory recursively.
cs: Příkaz `git add` je doplněn uvedením cesty buď k souboru, nebo k adresáři. Pokud se jedná o adresář, příkaz přidá rekurzivně všechny soubory v tomto adresáři.

source: The `git branch` command does more than just create and delete branches.
cs: Příkaz `git branch` umí víc, než jen vytvářet a mazat větve.

source: The `git branch` command only created a new branch — it didn’t switch to that branch (see Figure 3-5).
cs: Příkazem `git branch` jste pouze vytvořili novou větev, zatím jste na ni nepřepnuli (viz obrázek 3-5).

source: The `git describe` command favors annotated tags (tags created with the `-a` or `-s` flag), so release tags should be created this way if you’re using `git describe`, to ensure the commit is named properly when described.
cs: Příkaz `git describe` upřednostňuje anotované značky (značky vytvořené s příznakem `-a` nebo `-s`). Pokud tedy používáte příkaz `git describe`, abyste se při vytváření popisu ujistili, že je revize pojmenována správně, měli byste značky jednotlivých vydání vytvářet tímto způsobem.

source: The `git fetch` command updates your remote references.
cs: Příkaz `git fetch` aktualizuje vaše reference na vzdálený server.

source: The `git rm` command does that and also removes the file from your working directory so you don’t see it as an untracked file next time around.
cs: Odstranění provedete příkazem `git rm`, který odstraní soubor zároveň z vašeho pracovního adresáře, a proto ho už příště neuvidíte mezi nesledovanými soubory.

source: The `git status` command reminds you:
cs: Připomene vám to příkaz `git status`:

source: The `git svn` tools are useful if you’re stuck with a Subversion server for now or are otherwise in a development environment that necessitates running a Subversion server.
cs: Nástroje `git svn` využijete, jestliže chcete pozvolna přejít ze systému Subversion na systém Git nebo pokud pracujete ve vývojovém prostředí, v němž je z nějakého důvodu nutné používat server Subversion.

source: The `git svn` toolset provides a number of commands to help ease the transition to Git by providing some functionality that’s similar to what you had in Subversion.
cs: Sada nástrojů `git svn` dává uživateli do ruky celou řadu příkazů, jež jsou svou funkcí podobné příkazům v systému Subversion a uživateli tím usnadňují přechod do systému Git.

source: The `git verify-pack` plumbing command allows you to see what was packed up:
cs: Nízkoúrovňový příkaz `git verify-pack` umožňuje prohlížet, co bylo zabaleno:

source: The `git-receive-pack` command immediately responds with one line for each reference it currently has — in this case, just the `master` branch and its SHA.
cs: Příkaz `git-receive-pack` okamžitě odpoví jedním řádkem pro každou referenci, kterou v danou chvíli obsahuje – v tomto případě je to pouze větev `master` a její SHA.

source: The `gitosis.conf` file is the control file you use to specify users, repositories, and permissions.
cs: Soubor `gitosis.conf` je řídicí soubor, který slouží ke specifikaci uživatelů, repozitářů a oprávnění.

source: The `hooks` directory contains your client- or server-side hook scripts, which are discussed in detail in Chapter 7.
cs: Adresář `hooks` obsahuje skripty zásuvných modulů na straně klienta nebo serveru, které jsme podrobně popisovali v kapitole 7.

source: The `keydir` directory is where you store the public keys of all the users who have any sort of access to your repositories — one file per user.
cs: V adresáři `keydir` jsou pak uloženy veřejné klíče pro všechny uživatele, kteří mají (ať už jakýkoli) přístup k vašim repozitářům – jeden soubor pro každého uživatele.

source: The `master^{tree}` syntax specifies the tree object that is pointed to by the last commit on your `master` branch.
cs: Syntaxe `master^{tree}` určuje objekt stromu, na nějž ukazuje poslední revize větve `master`.

source: The `objects` directory stores all the content for your database, the `refs` directory stores pointers into commit objects in that data (branches), the `HEAD` file points to the branch you currently have checked out, and the `index` file is where Git stores your staging area information.
cs: V adresáři `objects` je uložen celý obsah vaší databáze, v adresáři `refs` jsou uloženy ukazatele na objekty revizí v datech (větve). Soubor `HEAD` ukazuje na větev, na níž se právě nacházíte, a soubor `index` je pro systém Git úložištěm informací o oblasti připravených změn.

source: The `oneline` and `format` options are particularly useful with another `log` option called `--graph`.
cs: Parametry `oneline` a `format` jsou zvlášť užitečné ve spojení s další možností `log`u – parametrem `--graph`.

source: The `oneline` option prints each commit on a single line, which is useful if you’re looking at a lot of commits.
cs: Parametr `oneline` vypíše všechny revize na jednom řádku. Tuto možnost oceníte při velkém množství revizí.

source: The `post-receive` hook runs after the entire process is completed and can be used to update other services or notify users.
cs: Zásuvný modul `post-receive` se spouští až poté, co je celý proces dokončen. Lze ho použít k aktualizaci jiných služeb nebo odeslání oznámení jiným uživatelům.

source: The `post-update` hook that comes with Git by default runs the appropriate command (`git update-server-info`) to make HTTP fetching and cloning work properly.
cs: Zásuvný modul `post-update`, který je standardně součástí systému Git, spustí příslušný příkaz (`git update-server-info`), který zajistí správné vyzvedávání a klonování dat přes protokol HTTP.

source: The `pre-commit` hook is run first, before you even type in a commit message.
cs: Zásuvný modul `pre-commit` se spouští jako první, ještě než začnete psát zprávu k revizi.

source: The `pre-rebase` hook runs before you rebase anything and can halt the process by exiting non-zero.
cs: Zásuvný modul `pre-rebase` se spouští před každým přeskládáním a při nenulové hodnotě může tento proces zastavit.

source: The `prepare-commit-msg` hook is run before the commit message editor is fired up but after the default message is created.
cs: Zásuvný modul `prepare-commit-msg` se spouští ještě předtím, než se otevře editor pro vytvoření zprávy k revizi, ale poté, co byla vytvořena výchozí zpráva.

source: The `rack` directory is there, but empty.
cs: Máte sice adresář `rack`, ten je však prázdný.

source: The `request-pull` command takes the base branch into which you want your topic branch pulled and the Git repository URL you want them to pull from, and outputs a summary of all the changes you’re asking to be pulled in.
cs: Příkaz `request-pull` vezme základní větev (základnu), do níž chcete natáhnout svou tematickou větev, a adresu URL repozitáře Git, z nějž chcete práci natáhnout, a vytvoří shrnutí všech změn, které by měl správce podle vaší žádosti natáhnout.

source: The `send-pack` process runs on the client and connects to a `receive-pack` process on the remote side.
cs: Proces `send-pack` se spouští na klientovi a připojuje se k procesu `receive-pack` na straně vzdáleného serveru.

source: The `size-pack` entry is the size of your packfiles in kilobytes, so you’re using 2MB.
cs: Řádek `size-pack` uvádí velikost vašich balíčkových souborů v kilobytech, využity jsou tedy 2 MB.

source: The ability of smaller subgroups of a team to collaborate via remote branches without necessarily having to involve or impede the entire team is a huge benefit of Git.
cs: Možnost, aby několik menších podskupin jednoho týmu spolupracovalo prostřednictvím vzdálených větví a aby si práce nevyžádala účast celého týmu nebo nebránila ostatním v jiné práci, je velkou devízou systému Git.

source: The above times (`AuthorDate`, `CommitDate`) are displayed in default format (`--date=default`), which shows timezone information of respective author and commiter.
cs: Výše uvedené časy (`AuthorDate`, `CommitDate`) se zobrazují v základním tvaru (`--date=default`), který zobrazuje informaci o časovém pásmu autora nebo přispěvatele.

source: The access rules are checked in order of appearance in the config file, looking for a match for this combination (but remember that the refname is regex-matched, not merely string-matched).
cs: Pravidla pro přístup jsou procházena postupně v pořadí, tak jak jsou uvedena v konfiguračním souboru a hledají se záznamy odpovídající této kombinaci uživatelského jména a reference (nezapomeňte ale, že refname se porovnává jako regulární výraz nikoliv jako pouhý řetězec).

source: The answer is the HEAD file.
cs: Odpověď zní: soubor HEAD.

source: The answer to this dilemma is to provide some client-side hooks that users can use to notify them when they’re doing something that the server is likely to reject.
cs: Problém vám mohou pomoci vyřešit zásuvné moduly na straně klienta. Poskytněte je svým uživatelům a ti budou upozorněni pokaždé, až provedou něco, co by server s největší pravděpodobností odmítl.

source: The answer to this issue is the `git stash` command.
cs: Řešením této situace je odložení (stashing) příkazem `git stash`.

source: The apply option only tries to apply the stashed work — you continue to have it on your stack.
cs: Parametr apply se pouze pokusí aplikovat odloženou práci, ta zůstává uložena ve vašem zásobníku.

source: The author information is taken from the e-mail’s `From` and `Date` headers, and the message of the commit is taken from the `Subject` and body (before the patch) of the e-mail.
cs: Informace o autorovi jsou převzaty z polí `From` a `Date` v e-mailu a zpráva k revizi je převzata z `Subject` a těla e-mailu (před samotnou záplatou).

source: The base command in Git for all the Subversion bridging commands is `git svn`.
cs: Základním příkazem systému Git ke všem operacím směřujícím do systému Subversion je `git svn`.

source: The basic Git workflow goes something like this:
cs: Standardní pracovní postup vypadá v systému Git následovně:

source: The beauty of the HTTP or HTTPS protocol is the simplicity of setting it up.
cs: Co je na protokolu HTTP nebo HTTPS sympatické, je jejich jednoduché nastavení.

source: The benevolent dictator’s repository serves as the reference repository from which all the collaborators need to pull.
cs: Repozitář benevolentního diktátora slouží jako referenční repozitář, z nějž všichni spolupracovníci musí stahovat data.

source: The best solution is to find some tool that does conversion for your binary format to a text representation.
cs: Nejlepší by bylo, kdybyste našli nějaký nástroj, který vám binární tvar na textový převede.

source: The big object is at the bottom: 2MB.
cs: Hledaný velký objekt se nachází úplně dole: 2 MB.

source: The blank line separating the summary from the body is critical (unless you omit the body entirely); tools like rebase can get confused if you run the two together.
cs: Prázdný řádek oddělující shrnutí od těla zprávy je nezbytně nutný (pokud nehodláte vypustit celé tělo). Spojení obou částí může zmást některé nástroje, např. přeskládání.

source: The blob is now a different blob, which means that although you added only a single line to the end of a 400-line file, Git stored that new content as a completely new object:
cs: Nyní jde o úplně jiný blob. Přestože jste na konec 400řádkového souboru vložili jen jeden jediný řádek, Git uložil nový obsah jako úplně nový objekt:

source: The book’s first eight chapters deal almost exclusively with porcelain commands.
cs: Prvních osm kapitol této knihy se zabývá téměř výhradně vysokoúrovňovými příkazy.

source: The branch histories have diverged.
cs: Historie větví se rozdělila.

source: The branch that HEAD points to moves forward with each commit.
cs: Větev, na niž ukazuje soubor HEAD, se posouvá vpřed s každou revizí.

source: The changes to your files were reapplied, but the file you staged before wasn’t restaged.
cs: Změny byly znovu aplikovány na vaše soubory, ale soubor, který jste předtím připravili k zapsání, nebyl znovu připraven.

source: The client initiates a `fetch-pack` process that connects to an `upload-pack` process on the remote side to negotiate what data will be transferred down.
cs: Klient iniciuje proces `fetch-pack`, který vytvoří připojení k procesu `upload-pack` na straně vzdáleného serveru a dojedná, která data budou stažena.

source: The client-side hooks are for client operations such as committing and merging.
cs: Zásuvné moduly na straně klienta jsou určeny pro operace klienta, např. zapisování revizí či slučování.

source: The code looks like this:
cs: Kód má tuto podobu:

source: The command for this is simple: `git push [remote-name] [branch-name]`.
cs: Příkaz pro tuto akci je jednoduchý: `git push [název vzdáleného repozitáře] [název větve]`.

source: The command goes out to that remote project and pulls down all the data from that remote project that you don’t have yet.
cs: Příkaz zamíří do vzdáleného projektu a stáhne z něj všechna data, která ještě nemáte u sebe.

source: The command helpfully tells you that if you’re on the master branch and you run `git pull`, it will automatically merge in the master branch on the remote after it fetches all the remote references.
cs: Příkaz vám mimo jiné sděluje, že pokud se nacházíte na hlavní větvi (branch `master`) a spustíte příkaz `git pull`, pak se po vyzvednutí všech vzdálených referencí (fetch) práce z hlavní větve na vzdáleném serveru automaticky začlení (merge).

source: The command is `filter-branch`, and it can rewrite huge swaths of your history, so you probably shouldn’t use it unless your project isn’t yet public and other people haven’t based work off the commits you’re about to rewrite.
cs: Příkaz pro tento případ je `filter-branch`. Dokáže přepsat velké části vaší historie, a proto byste ho určitě neměli používat, pokud už byl váš projekt zveřejněn a ostatní uživatelé už založili svou práci na revizích, které hodláte přepsat.

source: The command is a bit strange, but it works.
cs: Příkaz je sice trochu zvláštní, ale funguje.

source: The command just shows the commit:
cs: Příkaz zobrazí pouze samotnou revizi:

source: The command to do this is `git archive`:
cs: Příkaz pro vytvoření archivu zní `git archive`:

source: The commit message by default looks something like this:
cs: Zpráva revize má v takovém případě přednastavenu tuto podobu:

source: The commit message must be expressed in a special format:
cs: Zpráva k revizi musí být ve speciálním formátu:

source: The committing-workflow client-side scripts can be used in just about any workflow.
cs: Skripty k zapisování revizí na straně klienta lze používat prakticky v každém pracovním postupu.

source: The config file syntax for Gitolite is well documented, so we’ll only mention some highlights here.
cs: Syntaxe konfiguračního souboru pro Gitolite je dobře dokumentovaná, takže zde zdůrazníme jen pár věcí.

source: The configuration options recognized by Git fall into two categories: client side and server side.
cs: Parametry konfigurace systému Git se dělí do dvou kategorií: strana klienta a strana serveru.

source: The cons of this method are that shared access is generally more difficult to set up and reach from multiple locations than basic network access.
cs: Nevýhodou této metody je, že nastavit a získat sdílený přístup z více umístění je většinou těžší než obyčejný síťový přístup.

source: The content structure of your current Git data.
cs: Struktura obsahu vašich současných dat Git

source: The content-addressable filesystem layer is amazingly cool, so I’ll cover that first in this chapter; then, you’ll learn about the transport mechanisms and the repository maintenance tasks that you may eventually have to deal with.
cs: Na systému Git je skvělý jeho obsahově adresovatelný systém souborů, a proto se v této kapitole zaměřím nejprve na něj. Poté se podíváme na mechanismy přenosu a úkony správy repozitářů, s nimiž se můžete jednou setkat.

source: The contributor pushes to their own public copy.
cs: Přispěvatel odešle změny do své vlastní veřejné kopie.

source: The contributor sends the maintainer an e-mail asking them to pull changes.
cs: Přispěvatel pošle správci e-mail s žádostí, aby natáhl změny do projektu.

source: The core.pager setting determines what pager is used when Git pages output such as `log` and `diff`.
cs: Nastavení core.pager určuje, jaký stránkovač bude použit, musí-li Git rozdělit výpis na stránky (např. výstup příkazu `log` nebo `diff`).

source: The default branch name in Git is master.
cs: Výchozím názvem větve v systému Git je `master` (hlavní větev).

source: The dictator merges the lieutenants’ master branches into the dictator’s master branch.
cs: Diktátor začleňuje hlavní větve poručíků do své hlavní větve.

source: The dictator pushes their master to the reference repository so the other developers can rebase on it.
cs: Diktátor odesílá svou hlavní větev do referenčního repozitáře, aby si na jeho základě mohli ostatní vývojáři přeskládat data.

source: The diff viewer in the bottom half of the window shows you the changes introduced at any commit you click.
cs: Prohlížeč rozdílů v dolní polovině okna zobrazuje změny provedené v každé revizi, na niž kliknete.

source: The diff wrapper checks to make sure seven arguments are provided and passes two of them to your merge script.
cs: Wrapper nástroje diff zkontroluje zda je skutečně zadáno sedm parametrů a předá dva z nich do skriptu pro slučování.

source: The difference becomes apparent when you specify a number.
cs: Rozdíl mezi nimi je patrný při zadání čísla.

source: The difference is how you submit them to the project.
cs: Liší se to, jak je budete doručovat do projektu.

source: The double-dot syntax is useful as a shorthand; but perhaps you want to specify more than two branches to indicate your revision, such as seeing what commits are in any of several branches that aren’t in the branch you’re currently on.
cs: Zápis s dvěma tečkami přestavuje užitečnou zkratku. Možná ale budete chtít k označení revize určit více než dvě větve, např. až budete chtít zjistit, které revize jsou obsaženy ve všech ostatních větvích a zároveň nejsou obsaženy ve větvi, na níž se právě nacházíte.

source: The downside of serving your repository over HTTP is that it’s relatively inefficient for the client.
cs: Nevýhodou obsluhy repozitáře přes protokol HTTP je poměrně nízká výkonnost pro klienta.

source: The downside of the Git protocol is the lack of authentication.
cs: Nevýhodou protokolu Git je, že neprovádí autentizaci.

source: The downside to this approach is the whining that will inevitably result when your users’ commit pushes are rejected.
cs: Nevýhodou uvedeného postupu jsou nářky vašich uživatelů, které vás nevyhnutelně čekají jako výsledek odmítnutí jejich revizí.

source: The easiest is to use the graphical Git installer, which you can download from the SourceForge page (see Figure 1-7):
cs: Tím nejjednodušším je použít grafický instalátor Git, který si můžete stáhnout ze stránky SourceForge (viz obrázek 1-7):

source: The easiest way is to specify `-a` when you run the `tag` command:
cs: Nejjednodušším způsobem je zadat k příkazu `tag` parametr `-a`:

source: The easiest way to integrate the branches, as we’ve already covered, is the `merge` command.
cs: Víme, že nejjednodušším způsobem, jak integrovat větve, je příkaz `merge`.

source: The editor displays the following text (this example is a Vim screen):
cs: Editor zobrazí následující text (tento příklad je z editoru Vim):

source: The end snapshot should be identical no matter which order she chooses; only the history will be slightly different.
cs: Konečný snímek bude stejný, ať zvolí jakékoli pořadí, mírně se bude lišit jen historie revizí.

source: The entire output of this process looks like this:
cs: Celý výstup tohoto procesu vypadá následovně:

source: The example `pre-rebase` hook that Git installs does this, although it assumes that next is the name of the branch you publish.
cs: Ukázkový zásuvný modul `pre-rebase`, který Git nainstaluje, dělá právě toto, ačkoli předpokládá, že následuje název větve, kterou publikujete.

source: The examples in the previous section show `schacon` in some places, such as the `blame` output and the `git svn log`.
cs: V předchozí části se u některých příkladů (výstupy příkazů `blame` nebo `git svn log`) objevilo jméno `schacon`.

source: The expression after the `RW` or `RW+` is a regular expression (regex) that the refname (ref) being pushed is matched against.
cs: Výraz za `RW` nebo `RW+` je regulární výraz (regex), se kterým se porovnává jméno odesílané reference (ref).

source: The fetch process is a series of GET requests, where the client can assume the layout of the Git repository on the server.
cs: Proces vyzvednutí dat je sledem požadavků GET, kdy klient dokáže předpokládat rozložení repozitáře Git na serveru.

source: The file is meant to be consumed by a machine.
cs: Soubor je určen ke strojovému zpracování.

source: The files end up looking like this:
cs: Soubory nakonec vypadají takto:

source: The first developer, John, clones the repository, makes a change, and commits locally.
cs: První vývojář, John, naklonuje repozitář, provede změny a zapíše lokální revizi.

source: The first four hooks have to do with the committing process.
cs: První čtyři zásuvné moduly se týkají zapisování revizí.

source: The first hook that is run is `applypatch-msg`.
cs: První zásuvným modulem, který se spouští, je `applypatch-msg`.

source: The first is `git svn create-ignore`, which automatically creates corresponding `.gitignore` files for you so your next commit can include them.
cs: Tím prvním je `git svn create-ignore`, jenž automaticky vytvoří odpovídající soubory `.gitignore`, podle nichž se bude řídit už vaše příští revize.

source: The first is at the repository level; if you have read (or write) access to _any_ ref in the repository, then you have read (or write) access to the repository.
cs: První je úroveň repozitářů; jestliže máte práva na čtení (nebo zápis) _k jakékoliv_ referenci v repozitáři, máte tím práva na čtení (nebo zápis) k tomuto repozitáři.
